---
kind: enumMember
id: F:Autodesk.Revit.UI.SketchGalleryOptions.SGO_RunArcCenterEnds
enum: Autodesk.Revit.UI.SketchGalleryOptions
source: html/3df59ea1-731b-ebb5-a602-aa0f56899344.htm
---
# Autodesk.Revit.UI.SketchGalleryOptions.SGO_RunArcCenterEnds

Sketch a Center-Ends spiral for a run of stairs.